CARAVAN/app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "category" = ?, "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "テスト更新"], ["category", "テスト更新"], ["body", "テスト更新"], ["updated_at", "2020-12-28 02:56:55.588254"], ["id", 1]]
---
  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)